org/erm.org
#+SETUPFILE:./hugo_setup.org
#+TITLE: Empirical Risk Minimization

In [[file:machine_learning.org][Machine Learning]], the training set error is often called the
/empirical error/ or /empirical risk/, and this is the error the
classifier incurs over the sample:

\begin{equation}
L_S(h) = \frac{|\{i \in [m] : h(x_i) \ne y_i\}}{m}
\end{equation}

Given a hypothesis class $H$, finding the hypothesis $h \in H$ that
minimizes the empirical risk is a simple learning strategy.
